In [2]:
import pandas as pd # pandas 모듈 호출
import numpy as np # numpy 모듈 호출
from pandas import Series, DataFrame
list_data = [ 1,2,3,4,5]
list_name = [ "a","b","c","d","e"]
example_obj = Series(data = list_data, index=list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
from pandas import Series, DataFrame
raw_data = { 'first_name': [ 'Jason', 'Molly', 'Tina', 'Jake', 'Amy'] ,
'last_name': [ 'Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'] ,
'age': [ 42, 52, 36, 24, 73] ,
'city': [ 'San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston'] }
df = pd.DataFrame(raw_data, columns = [ 'first_name', 'last_name',
'age', 'city'] )
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [4]:
DataFrame(raw_data,
columns = [ "first_name","last_name","age", "city", "debt"])

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [6]:
import pandas as pd # pandas 모듈 호출
import numpy as np # numpy 모듈 호출
ipl_data = { 'Team': [ 'Riders', 'Riders', 'Devils', 'Devils', 'Kings','kings',
'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'] ,
'Rank': [ 1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2] ,
'Year': [ 2014, 2015, 2014, 2015, 2014, 2015, 2016, 2017, 2016, 2014,
2015, 2017] ,
'Points':[ 876,789,863,673,741,812,756,788,694,701,804,690] }
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [7]:
multi_groupby = df.groupby([ "Team", "Year"] )[ "Points"] .sum()
multi_groupby

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64